app/controllers/items_controller.rb

INSERT INTO "items" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", nil], ["created_at", "2022-08-11 15:41:18.310905"], ["updated_at", "2022-08-11 15:41:18.310905"]]
---
  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save